examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_028/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    inlet_0
    {
        type            patch;
        nFaces          5;
        startFace       15760;
    }
    inlet_1
    {
        type            patch;
        nFaces          5;
        startFace       15765;
    }
    inlet_2
    {
        type            patch;
        nFaces          5;
        startFace       15770;
    }
    inlet_3
    {
        type            patch;
        nFaces          5;
        startFace       15775;
    }
    inlet_4
    {
        type            patch;
        nFaces          5;
        startFace       15780;
    }
    inlet_5
    {
        type            patch;
        nFaces          5;
        startFace       15785;
    }
    inlet_6
    {
        type            patch;
        nFaces          5;
        startFace       15790;
    }
    inlet_7
    {
        type            patch;
        nFaces          5;
        startFace       15795;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       15800;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       15840;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       15840;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       16240;
    }
)

// ************************************************************************* //
